Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PipingPortDefault::Modifier Class Reference
MEP Element Manager
Modifier of the PipingPortDefault. More...
#include <MEPPipingPortDefault.hpp>
 Inheritance diagram for ACAPI::MEP::PipingPortDefault::Modifier:
 Public Member Functions
void  | SetDiameter (double diameter)
Sets the diameter of the PipingPort.
void  | SetWallThickness (double thickness)
Sets the thickness of the PipingPort's wall.
void  | SetFlowDirection (FlowDirection flowDirection)
Sets the flow direction of the PipingPort.
 Public Member Functions inherited from ACAPI::MEP::PortDefaultBase::Modifier
void  | SetWidth (double width)
Sets the width of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions
Modifier (PipingPortDefault &parent)
Constructs a Modifier with the given PipingPortDefault parent.
 Protected Member Functions inherited from ACAPI::MEP::PortDefaultBase::Modifier
Modifier (PortDefaultBase &parent)
Constructs a Modifier with the given PortDefaultBase parent.
Detailed Description
Modifier of the PipingPortDefault.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::PipingPortDefault::Modifier::Modifier  |  ( |  PipingPortDefault & |  parent | )
protected
Constructs a Modifier with the given PipingPortDefault parent.
Parameters
parent | The parent PipingPortDefault.
Member Function Documentation
◆ SetDiameter()
 void ACAPI::MEP::PipingPortDefault::Modifier::SetDiameter  |  ( |  double |  diameter | )
Sets the diameter of the PipingPort.
Parameters
diameter | The value to be set.
◆ SetFlowDirection()
 void ACAPI::MEP::PipingPortDefault::Modifier::SetFlowDirection  |  ( |  FlowDirection |  flowDirection | )
Sets the flow direction of the PipingPort.
Parameters
flowDirection | The value to be set.
◆ SetWallThickness()
 void ACAPI::MEP::PipingPortDefault::Modifier::SetWallThickness  |  ( |  double |  thickness | )
Sets the thickness of the PipingPort's wall.
Parameters
thickness | The value to be set.